[
	{
		"question": "Create a variable <mark>i</mark> with the value of <mark>10</mark>",
		"code": "// write your code below \n",
		"keywords": ["let", "i", "10"],
		"assert": "i === 10",
		"errorMessage": "The value of i is not correct",
		"title": "Creation of variables",
		"infoBeforeCode": "In JavaScript, variables are used to store values or data that can be used later in the program. The three most common ways to declare variables in JavaScript are <mark>var</mark>, <mark>let</mark>, and <mark>const</mark>.<br><br><mark>var</mark> is used to declare a variable that can be accessed anywhere within the function or even outside the function. This means that the value of a <mark>var</mark> variable can be changed or updated throughout the program.<br><br><mark>let</mark> and <mark>const</mark> are used to declare variables that have a limited scope, meaning that they are only accessible within a specific block of code (e.g., within a loop or a function). The main difference between <mark>let</mark> and <mark>const</mark> is that <mark>let</mark> allows the value of the variable to be changed or updated later in the program, while const does not allow the value to be changed once it has been declared.<br><br>For example, let's say we want to store the name of a person in a variable:<br>",
		"infoAfterCode": "In this example, we first declare the variable <mark>name</mark> using <mark>var</mark>, <mark>let</mark>, and <mark>const</mark>. We then try to change the value of name to 'Mary'. With <mark>var</mark> and <mark>let</mark>, this is possible and the output is 'Mary'. However, with <mark>const</mark>, an error is thrown because we are trying to change the value of a constant variable.<br><br>In summary, <mark>var</mark>, <mark>let</mark>, and <mark>const</mark> are used to declare variables in JavaScript. <mark><</mark> has a wider scope and allows the value of the variable to be changed later in the program, while <mark>let</mark> and <mark>const</mark> have a limited scope and <mark>const</mark> does not allow the value to be changed once it has been declared.",
		"infoCode": [
			"// Using var",
			"var name = 'John';",
			"name = 'Mary';",
			"console.log(name); // Output: Mary",
			"",
			"// Using let",
			"let name = 'John';",
			"name = 'Mary';",
			"console.log(name); // Output: Mary",
			"",
			"// Using const",
			"var name = 'John';",
			"name = 'Mary'; // Error: Assignment to constant variable",
			"console.log(name); // Output: Mary"
		]
	},
	{
		"question": "Set the value of the variable <mark>i</mark> so that the following equation is correct: <u>i + 7 = 10</u>",
		"code": "// edit the code below\nlet i = 50;",
		"keywords": ["i"],
		"assert": "i+7 === 10",
		"errorMessage": "The value of i is not correct for the equation to be to correct"
	}
]
